roncarr880/uBitX_Teensy/p18f2220.h
;----- CONFIG1H Options --------------------------------------------------
_LP_OSC              EQU  H'F0'    ; LP Oscillator
_LP_OSC_1H           EQU  H'F0'    ; LP Oscillator
_XT_OSC              EQU  H'F1'    ; XT Oscillator
_XT_OSC_1H           EQU  H'F1'    ; XT Oscillator
_HS_OSC              EQU  H'F2'    ; HS Oscillator
_HS_OSC_1H           EQU  H'F2'    ; HS Oscillator
_EC_OSC              EQU  H'F4'    ; EC oscillator, CLKO function on RA6
_EC_OSC_1H           EQU  H'F4'    ; EC oscillator, CLKO function on RA6
_ECIOP_OSC           EQU  H'F5'    ; EC oscillator, port function on RA6
_ECIOP_OSC_1H        EQU  H'F5'    ; EC oscillator, port function on RA6
_ECIO_OSC_1H         EQU  H'F5'    ; EC oscillator, port function on RA6
_HSPLL_OSC           EQU  H'F6'    ; HS oscillator, PLL enabled (clock frequency = 4 x FOSC1)
_HSPLL_OSC_1H        EQU  H'F6'    ; HS oscillator, PLL enabled (clock frequency = 4 x FOSC1)
_RCIO_OSC            EQU  H'F7'    ; External RC oscillator, port function on RA6
_RCIO_OSC_1H         EQU  H'F7'    ; External RC oscillator, port function on RA6
_INTIO2_OSC          EQU  H'F8'    ; Internal RC oscillator, port function on RA6 and port function on RA7
_INTIO2_OSC_1H       EQU  H'F8'    ; Internal RC oscillator, port function on RA6 and port function on RA7
_INTIO1_OSC          EQU  H'F9'    ; Internal RC oscillator, CLKO function on RA6 and port function on RA7
_INTIO1_OSC_1H       EQU  H'F9'    ; Internal RC oscillator, CLKO function on RA6 and port function on RA7
_RC_OSC              EQU  H'FC'    ; External RC oscillator, CLKO function on RA6
_RC_OSC_1H           EQU  H'FC'    ; External RC oscillator, CLKO function on RA6

_FSCM_OFF_1H         EQU  H'BF'    ; Fail-Safe Clock Monitor disabled
_FSCM_ON_1H          EQU  H'FF'    ; Fail-Safe Clock Monitor enabled

_IESO_OFF_1H         EQU  H'7F'    ; Internal/External Switchover mode disabled
_IESO_ON_1H          EQU  H'FF'    ; Internal/External Switchover mode enabled

;----- CONFIG2L Options --------------------------------------------------
_PWRT_ON_2L          EQU  H'FE'    ; PWRT enabled
_PWRT_OFF_2L         EQU  H'FF'    ; PWRT disabled

_BOR_OFF_2L          EQU  H'FD'    ; Brown-out Reset disabled
_BOR_ON_2L           EQU  H'FF'    ; Brown-out Reset enabled

_BORV_45_2L          EQU  H'F3'    ; VBOR set to 4.5V
_BORV_42_2L          EQU  H'F7'    ; VBOR set to 4.2V
_BORV_27_2L          EQU  H'FB'    ; VBOR set to 2.7V
_BORV_20_2L          EQU  H'FF'    ; VBOR set to 2.0V

;----- CONFIG2H Options --------------------------------------------------
_WDT_OFF_2H          EQU  H'FE'    ; WDT disabled (control is placed on the SWDTEN bit)
_WDT_ON_2H           EQU  H'FF'    ; WDT enabled

_WDTPS_1_2H          EQU  H'E1'    ; 1:1
_WDTPS_2_2H          EQU  H'E3'    ; 1:2
_WDTPS_4_2H          EQU  H'E5'    ; 1:4
_WDTPS_8_2H          EQU  H'E7'    ; 1:8
_WDTPS_16_2H         EQU  H'E9'    ; 1:16
_WDTPS_32_2H         EQU  H'EB'    ; 1:32
_WDTPS_64_2H         EQU  H'ED'    ; 1:64
_WDTPS_128_2H        EQU  H'EF'    ; 1:128
_WDTPS_256_2H        EQU  H'F1'    ; 1:256
_WDTPS_512_2H        EQU  H'F3'    ; 1:512
_1K                  EQU  H'F5'    ; 1:1024
_WDTPS_1K_2H         EQU  H'F5'    ; 1:1024
_2K                  EQU  H'F7'    ; 1:2048
_WDTPS_2K_2H         EQU  H'F7'    ; 1:2048
_4K                  EQU  H'F9'    ; 1:4096
_WDTPS_4K_2H         EQU  H'F9'    ; 1:4096
_8K                  EQU  H'FB'    ; 1:8192
_WDTPS_8K_2H         EQU  H'FB'    ; 1:8192
_16K                 EQU  H'FD'    ; 1:16384
_WDTPS_16K_2H        EQU  H'FD'    ; 1:16384
_32K                 EQU  H'FF'    ; 1:32768
_WDTPS_32K_2H        EQU  H'FF'    ; 1:32768

;----- CONFIG3H Options --------------------------------------------------
_CCP2MX_OFF          EQU  H'FE'    ; CCP2 input/output is multiplexed with RB3
_CCP2MX_OFF_3H       EQU  H'FE'    ; CCP2 input/output is multiplexed with RB3
_CCP2MX_B3           EQU  H'FE'    ; CCP2 input/output is multiplexed with RB3
_CCP2MX_B3_3H        EQU  H'FE'    ; CCP2 input/output is multiplexed with RB3
_CCP2MX_ON           EQU  H'FF'    ; CCP2 input/output is multiplexed with RC1
_CCP2MX_ON_3H        EQU  H'FF'    ; CCP2 input/output is multiplexed with RC1
_CCP2MX_C1           EQU  H'FF'    ; CCP2 input/output is multiplexed with RC1
_CCP2MX_C1_3H        EQU  H'FF'    ; CCP2 input/output is multiplexed with RC1

_PBAD_DIG_3H         EQU  H'FD'    ; PORTB<4:0> pins are configured as digital I/O on Reset
_PBAD_ANA_3H         EQU  H'FF'    ; PORTB<4:0> pins are configured as analog input channels on Reset

_MCLRE_OFF_3H        EQU  H'7F'    ; MCLR disabled; RE3 input is enabled in 40-pin devices only (PIC18F4X20)
_MCLRE_ON_3H         EQU  H'FF'    ; MCLR pin enabled; RE3 input pin disabled

;----- CONFIG4L Options --------------------------------------------------
_STVR_OFF_4L         EQU  H'FE'    ; Stack full/underflow will not cause Reset
_STVR_ON_4L          EQU  H'FF'    ; Stack full/underflow will cause Reset

_LVP_OFF_4L          EQU  H'FB'    ; Single-Supply ICSP disabled
_LVP_ON_4L           EQU  H'FF'    ; Single-Supply ICSP enabled

_DEBUG_ON_4L         EQU  H'7F'    ; Background debugger enabled, RB6 and RB7 are dedicated to In-Circuit Debug
_DEBUG_OFF_4L        EQU  H'FF'    ; Background debugger disabled, RB6 and RB7 configured as general purpose I/O pins

;----- CONFIG5L Options --------------------------------------------------
_CP0_ON_5L           EQU  H'FE'    ; Block 0 (000200-0007FFh) code-protected
_CP0_OFF_5L          EQU  H'FF'    ; Block 0 (000200-0007FFh) not code-protected

_CP1_ON_5L           EQU  H'FD'    ; Block 1 (000800-000FFFh) code-protected
_CP1_OFF_5L          EQU  H'FF'    ; Block 1 (000800-000FFFh) not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'    ; Boot block (000000-0001FFh) is code-protected
_CPB_OFF_5H          EQU  H'FF'    ; Boot block (000000-0001FFh) is not code-protected

_CPD_ON_5H           EQU  H'7F'    ; Data EEPROM is code-protected
_CPD_OFF_5H          EQU  H'FF'    ; Data EEPROM is not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'    ; Block 0 (000200-0007FFh) write-protected
_WRT0_OFF_6L         EQU  H'FF'    ; Block 0 (000200-0007FFh) not write-protected

