roncarr880/uBitX_Teensy/p18f2220.h
_WRT1_ON_6L          EQU  H'FD'    ; Block 1 (000800-000FFFh) write-protected
_WRT1_OFF_6L         EQU  H'FF'    ; Block 1 (000800-000FFFh) not write-protected

;----- CONFIG6H Options --------------------------------------------------
_WRTC_ON_6H          EQU  H'DF'    ; Configuration registers (300000-3000FFh) are write-protected
_WRTC_OFF_6H         EQU  H'FF'    ; Configuration registers (300000-3000FFh) are not write-protected

_WRTB_ON_6H          EQU  H'BF'    ; Boot block (000000-0001FFh) is write-protected
_WRTB_OFF_6H         EQU  H'FF'    ; Boot block (000000-0001FFh) is not write-protected

_WRTD_ON_6H          EQU  H'7F'    ; Data EEPROM is write-protected
_WRTD_OFF_6H         EQU  H'FF'    ; Data EEPROM is not write-protected

;----- CONFIG7L Options --------------------------------------------------
_EBTR0_ON_7L         EQU  H'FE'    ; Block 0 (000200-0007FFh) protected from table reads executed in other blocks
_EBTR0_OFF_7L        EQU  H'FF'    ; Block 0 (000200-0007FFh) not protected from table reads executed in other blocks

_EBTR1_ON_7L         EQU  H'FD'    ; Block 1 (000800-000FFFh) protected from table reads executed in other blocks
_EBTR1_OFF_7L        EQU  H'FF'    ; Block 1 (000800-000FFFh) not protected from table reads executed in other blocks

;----- CONFIG7H Options --------------------------------------------------
_EBTRB_ON_7H         EQU  H'BF'    ; Boot block (000000-0001FFh) is protected from table reads executed in other blocks
_EBTRB_OFF_7H        EQU  H'FF'    ; Boot block (000000-0001FFh) is not protected from table reads executed in other blocks


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'

        LIST


       ;declare constants used by the compiler
       ;list p = 18F2220
       radix  decimal
       
#define  rrf  rrcf
#define  rlf  rlcf

       ;set up vectors
       org   0          ; reset vector
       call  init
       goto _ml
       org   8
       goto  _interrupt  ; comment this out if you don't want interrupts
                        ; otherwise supply a _interrupt() C function
				; may want to use fast return
				; may want to use low priority vector at 0x18

_ml    call  main       ; loop
       goto  _ml


 ; -------------------- run time library  -------------------- */

        ; shifting, shift _temp with count in W
_rshift
        btfsc   STATUS,Z,A    
        return             ; ret if shift amount is zero
        bcf     STATUS,C,A   ; unsigned shift, mask bits
        rrcf     _temp,F
        addlw   255        ; sub one
        goto    _rshift

_lshift
        btfsc   STATUS,Z,A    
        return             ; ret if shift amount is zero
        bcf     STATUS,C,A   ; arithmetic shift
        rlcf     _temp,F
        addlw   255        ; sub one
        goto    _lshift

_eeadr                     ; set up EEDATA to contain desired data
        ;bcf     STATUS,RP0
        movwf   EEADR,A      ; correct address in W
        ;bsf     STATUS,RP0
        bsf     EECON1,RD,A
        ;bcf     STATUS,RP0
        movf    EEDATA,W
        movwf   _eedata
        return


; junk for compiler, define RP0
RP0     EQU     7  ; unused bit in status reg 

#endasm
                     /* set up C definitions for SFR's */
#pragma pic 3968   

char PORTA;
char PORTB;
char PORTC;
char PORTD;      /* not there */
char PORTE;

#pragma pic 3977

char LATA;
char LATB;
char LATC;
char LATD;
char LATE;

#pragma pic 3986

char TRISA;
char TRISB;
char TRISC;
char TRISD;
char TRISE;

#pragma pic 3995

char OSCTUNE;

#pragma pic 3997

char PIE1;
char PIR1;
char IPR1;
char PIE2;
char PIR2;
char IPR2;

#pragma pic 4006

char EECON1;
char EECON2;
char EEDATA;
char EEADR;
char BAUDCTL;    /* not there */
char RCSTA;
char TXSTA;
char TXREG;
char RCREG;
char SPBRG;
char SPBRGH;     /* not there */
char T3CON;
char TMR3L;
char TMR3H;
char CMCON;
char CVRCON;

#pragma pic 4022

char ECCPAS;      /* not there */
char PWM1CON;

#pragma pic 4026
char CCP2CON;
char CCPR2L;
char CCPR2H;
char CCP1CON;
char CCPR1L;
char CCPR1H;
char ADCON2;
char ADCON1;
char ADCON0;
char ADRESL;
char ADRESH;
char SSPCON2;
char SSPCON1;
char SSPSTAT;
char SSPADD;
char SSPBUF;

#pragma pic 4042

char T2CON;
char PR2;
char TMR2;
char T1CON;
char TMR1L;
char TMR1H;
char RCON;
char WDTCON;
char LVDCON;
char OSCCON;

#pragma pic 4053

char T0CON;
char TMR0L;
char TMR0H;
char STATUS;
char FSR2L;
char FSR2H;
char PLUSW2;
char PREINC2;
char POSTDEC2;
char POSTINC2;
char INDF2;
char BSR;
char FSR1L;
char FSR1H;
char PLUSW1;
char PREINC1;
char POSTDEC1;
char POSTINC1;
char INDF1;
char WREG;
char FSR0L;
char FSR0H;
char PLUSW0;
char PREINC0;
char POSTDEC0;
char POSTINC0;
char INDF0;
char INTCON3;
char INTCON2;
char INTCON;
char PRODL;
char PRODH;
char TABLAT;
char TBLPTRL;
char TBLPTRH;
char TBLPTRU;
char PCL;
char PCLATH;
char PCLATU;
char STKPTR;
char TOSL;
char TOSH;
char TOSU;

/* variable address to start of ram */
#pragma pic 0  

/* ------------------- end of shell set up ------------------- */

#pragma bsr
#pragma eesize 256
#pragma banksize 256
#pragma access 0 127
#pragma access 3968 4095



